Repository: EdilbertoFonseca/VisionAssistantPro
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: vi

source: Copy TON Address
vi: Sao chép địa chỉ TON

source: Copy USDT (TRC20) Address
vi: Sao chép địa chỉ USDT (TRC20)

source: Copy Support Email
vi: Sao chép email hỗ trợ

source: Maybe Later
vi: Để sau

source: Copied to clipboard! Your support is greatly appreciated!
vi: Đã sao chép vào clipboard! Rất trân trọng sự ủng hộ của bạn!

source: Success
vi: Thành công

source: Support the Future of {name}
vi: Ủng hộ tương lai của {name}

source: {name} is a project born from a personal vision to bridge the gap between AI and true accessibility. The initial concept and many of the features you enjoy were created from my own ideas to solve real challenges and provide a new level of digital independence. I take great pride in thinking through every detail and turning both my own innovations and your valuable requests into reality. Ensuring this tool remains fast, stable, and constantly evolving is a continuous creative journey that I am passionate about pursuing. Important Note: Due to international banking restrictions in my region, I am unable to use PayPal or Stripe. If you wish to support this project, you can donate via Cryptocurrency or by sending an Apple Gift Card (US region) to: {email} If this assistant has brought value to your daily life, your support is a wonderful way to show appreciation for the original work and the dedication behind it. Thank you for being part of this mission!
vi: Dự án {name} ra đời từ tầm nhìn cá nhân nhằm thu hẹp khoảng cách giữa AI và khả năng tiếp cận thực sự. Ý tưởng ban đầu và nhiều tính năng bạn đang sử dụng được tạo ra từ chính những ý tưởng của tôi để giải quyết những thách thức thực tế và mang lại một mức độ độc lập kỹ thuật số mới. Tôi rất tự hào khi suy nghĩ thấu đáo từng chi tiết và biến cả những đổi mới của riêng mình cũng như những yêu cầu quý giá của bạn thành hiện thực. Đảm bảo công cụ này luôn nhanh chóng, ổn định và không ngừng phát triển là một hành trình sáng tạo không ngừng mà tôi đam mê theo đuổi. Lưu ý quan trọng: Do những hạn chế về ngân hàng quốc tế tại khu vực của tôi, tôi không thể sử dụng PayPal hoặc Stripe. Nếu bạn muốn ủng hộ dự án này, bạn có thể quyên góp qua Tiền điện tử hoặc bằng cách gửi Apple Gift Card (khu vực Mỹ) tới: {email} Nếu trợ lý này mang lại giá trị cho cuộc sống hàng ngày của bạn, sự ủng hộ của bạn là một cách tuyệt vời để thể hiện sự trân trọng đối với công trình ban đầu và sự cống hiến đằng sau nó. Cảm ơn bạn đã là một phần của sứ mệnh này!

source: Name:
vi: Tên:

source: Prompt Text:
vi: Văn bản prompt:

source: Variables Guide
vi: Hướng dẫn về biến

source: Name cannot be empty.
vi: Tên không được để trống.

source: Validation Error
vi: Lỗi xác thực

source: Prompt text cannot be empty.
vi: Văn bản prompt không được để trống.

source: Prompt Variables Guide
vi: Hướng dẫn về biến prompt

source: Use these variables inside prompt text:
vi: Sử dụng các biến này bên trong văn bản prompt:

source: Close
vi: Đóng

source: Prompt Manager
vi: Quản lý prompt

source: Default Prompts
vi: Prompt mặc định

source: Custom Prompts
vi: Prompt tùy chỉnh

source: Changes are applied only when you press OK.
vi: Các thay đổi chỉ được áp dụng khi bạn nhấn OK.

source: Reset Selected
vi: Đặt lại mục đã chọn

source: Reset All
vi: Đặt lại tất cả

source: Apply to Selected
vi: Áp dụng cho mục đã chọn

source: Add
vi: Thêm

source: Edit
vi: Sửa

source: Remove
vi: Xóa

source: Move Up
vi: Di chuyển lên

source: Move Down
vi: Di chuyển xuống

source: Prompt Preview:
vi: Xem trước prompt:

source: This prompt is used by {feature}. To save it, add the required text below:
vi: Prompt này được sử dụng bởi {feature}. Để lưu lại, hãy thêm văn bản bắt buộc bên dưới:

source: Add these items exactly as written, then try again.
vi: Thêm các mục này chính xác như đã viết, sau đó thử lại.

source: Required Text Missing
vi: Thiếu văn bản bắt buộc

source: You are editing a prompt used by {feature}. If this prompt is changed, this feature may not work correctly. Do you understand the risk and want to save anyway?
vi: Bạn đang chỉnh sửa một prompt được sử dụng bởi {feature}. Nếu prompt này bị thay đổi, tính năng này có thể không hoạt động chính xác. Bạn có hiểu rủi ro và vẫn muốn lưu không?

source: Confirm
vi: Xác nhận

source: Yes, Save Anyway
vi: Có, vẫn lưu

source: No, Go Back
vi: Không, quay lại

source: Selected prompt updated.
vi: Đã cập nhật prompt được chọn.

source: Reset all default prompts to built-in values?
vi: Đặt lại tất cả prompt mặc định về giá trị gốc?

source: Confirm Reset
vi: Xác nhận đặt lại

source: Add Custom Prompt
vi: Thêm prompt tùy chỉnh

source: A custom prompt with this name already exists.
vi: Một prompt tùy chỉnh với tên này đã tồn tại.

source: Edit Custom Prompt
vi: Chỉnh sửa prompt tùy chỉnh

source: Remove custom prompt '{name}'?
vi: Xóa prompt tùy chỉnh '{name}'?

source: Confirm Remove
vi: Xác nhận xóa

source: [Auto]
vi: [Tự động]

source: (Latest)
vi: (Mới nhất)

source: [Free]
vi: [Miễn phí]

source: (Preview)
vi: (Bản xem trước)

source: Bright
vi: Sáng sủa

source: Upbeat
vi: Vui vẻ

source: Informative
vi: Nhiều thông tin

source: Firm
vi: Quả quyết

source: Excitable
vi: Sôi nổi

source: Youthful
vi: Trẻ trung

source: Breezy
vi: Thoải mái

source: Easy-going
vi: Dễ tính

source: Breathy
vi: Nhẹ nhàng

source: Clear
vi: Rõ ràng

source: Smooth
vi: Mượt mà

source: Gravelly
vi: Khàn

source: Soft
vi: Mềm mại

source: Even
vi: Đều đặn

source: Mature
vi: Trưởng thành

source: Forward
vi: Thẳng thắn

source: Friendly
vi: Thân thiện

source: Casual
vi: Bình thường

source: Gentle
vi: Dịu dàng

source: Lively
vi: Sống động

source: Knowledgeable
vi: Uyên bác

source: Warm
vi: Ấm áp

source: Chrome (Fast)
vi: Chrome (Nhanh)

source: Gemini (Formatted)
vi: Gemini (Được định dạng)

source: Refine
vi: Tinh chỉnh

source: Summarize
vi: Tóm tắt

source: Fix Grammar
vi: Sửa ngữ pháp

source: Fix Grammar & Translate
vi: Sửa ngữ pháp & Dịch

source: Explain
vi: Giải thích

source: Translation
vi: Dịch thuật

source: Smart Translation
vi: Dịch thông minh

source: Quick Translation
vi: Dịch nhanh

source: Document
vi: Tài liệu

source: Document Chat Context
vi: Ngữ cảnh trò chuyện tài liệu

source: Advanced
vi: Nâng cao

source: Document Chat Bootstrap Reply
vi: Phản hồi khởi động trò chuyện tài liệu

source: Vision
vi: Thị giác

source: Navigator Object Analysis
vi: Phân tích đối tượng Navigator

source: Full Screen Analysis
vi: Phân tích toàn màn hình

source: Vision Follow-up Context
vi: Ngữ cảnh tiếp theo của thị giác

source: Vision Follow-up Answer Rule
vi: Quy tắc trả lời tiếp theo của thị giác

source: Video Analysis
vi: Phân tích Video

source: Audio
vi: Âm thanh

source: Audio Transcription
vi: Chuyển biên âm thanh

source: Smart Dictation
vi: Đọc chính tả thông minh

source: OCR Image Extraction
vi: Trích xuất văn bản từ hình ảnh (OCR)

source: OCR Document Extraction
vi: Trích xuất văn bản từ tài liệu (OCR)

source: Document OCR + Translate
vi: OCR Tài liệu + Dịch

source: CAPTCHA Solver
vi: Giải CAPTCHA

source: Refine Files-Only Fallback
vi: Dự phòng tinh chỉnh chỉ dành cho tệp

source: Currently selected text
vi: Văn bản đang được chọn

source: Text
vi: Văn bản

source: Clipboard content
vi: Nội dung clipboard

source: Screenshot of the navigator object
vi: Ảnh chụp màn hình của đối tượng navigator

source: Image
vi: Hình ảnh

source: Screenshot of the entire screen
vi: Ảnh chụp toàn bộ màn hình

source: Select image/PDF/TIFF for text extraction
vi: Chọn hình ảnh/PDF/TIFF để trích xuất văn bản

source: Image, PDF, TIFF
vi: Hình ảnh, PDF, TIFF

source: Select document for reading
vi: Chọn tài liệu để đọc

source: Select audio file for analysis
vi: Chọn tệp âm thanh để phân tích

source: Custom:
vi: Tùy chỉnh:

source: {name} Error
vi: Lỗi {name}

source: Error 400: Bad Request (Check API Key)
vi: Lỗi 400: Yêu cầu không hợp lệ (Kiểm tra Khóa API)

source: Error 403: Forbidden (Check Region)
vi: Lỗi 403: Bị cấm (Kiểm tra Khu vực)

source: Error 429: Quota Exceeded (Try later)
vi: Lỗi 429: Vượt quá hạn ngạch (Thử lại sau)

source: Server Error {code}: {reason}
vi: Lỗi máy chủ {code}: {reason}

source: No API Keys configured.
vi: Chưa cấu hình Khóa API nào.

source: All API Keys failed (Quota/Server).
vi: Tất cả Khóa API đều thất bại (Hạn ngạch/Máy chủ).

source: Unknown error occurred.
vi: Đã xảy ra lỗi không xác định.

source: No API Keys.
vi: Không có Khóa API.

source: Upload failed.
vi: Tải lên thất bại.

source: All keys failed.
vi: Tất cả các khóa đều thất bại.

source: Update Available
vi: Có bản cập nhật mới

source: A new version ({version}) of {name} is available.
vi: Đã có phiên bản mới ({version}) của {name}.

source: Changes:
vi: Những thay đổi:

source: Download and Install?
vi: Tải xuống và Cài đặt?

source: &Yes
vi: &Có

source: &No
vi: &Không

source: Update found but no .nvda-addon file in release.
vi: Đã tìm thấy bản cập nhật nhưng không có tệp .nvda-addon trong bản phát hành.

source: You have the latest version.
vi: Bạn đang sử dụng phiên bản mới nhất.

source: Update check failed: {error}
vi: Kiểm tra cập nhật thất bại: {error}

source: Downloading update...
vi: Đang tải xuống bản cập nhật...

source: Download failed: {error}
vi: Tải xuống thất bại: {error}

source: AI Response:
vi: Phản hồi của AI:

source: Ask:
vi: Hỏi:

source: Send
vi: Gửi

source: View Formatted
vi: Xem định dạng

source: Save Content
vi: Lưu nội dung

source: Save Chat
vi: Lưu trò chuyện

source: You: {text}
vi: Bạn: {text}

source: Thinking...
vi: Đang suy nghĩ...

source: Formatted Conversation
vi: Cuộc trò chuyện đã định dạng

source: Error displaying content: {error}
vi: Lỗi khi hiển thị nội dung: {error}

source: Save Chat Log
vi: Lưu nhật ký trò chuyện

source: Saved.
vi: Đã lưu.

source: Save failed: {error}
vi: Lưu thất bại: {error}

source: Save Result
vi: Lưu kết quả

source: Connection
vi: Kết nối

source: Gemini API Key (Separate multiple keys with comma or newline):
vi: Khóa API Gemini (Phân tách nhiều khóa bằng dấu phẩy hoặc xuống dòng):

source: Show API Key
vi: Hiển thị Khóa API

source: AI Model:
vi: Mô hình AI:

source: Proxy URL:
vi: URL Proxy:

source: Check for updates on startup
vi: Kiểm tra cập nhật khi khởi động

source: Clean Markdown in Chat
vi: Làm sạch Markdown trong trò chuyện

source: Copy AI responses to clipboard
vi: Sao chép phản hồi của AI vào clipboard

source: Direct Output (No Chat Window)
vi: Đầu ra trực tiếp (Không có cửa sổ trò chuyện)

source: Translation Languages
vi: Ngôn ngữ dịch

source: Source:
vi: Nguồn:

source: Target:
vi: Đích:

source: Smart Swap
vi: Chuyển đổi thông minh

source: Document Reader
vi: Trình đọc tài liệu

source: OCR Engine:
vi: Công cụ OCR:

source: TTS Voice:
vi: Giọng nói TTS:

source: Capture Method:
vi: Phương pháp chụp:

source: Navigator Object
vi: Đối tượng Navigator

source: Full Screen
vi: Toàn màn hình

source: Prompts
vi: Prompt

source: Manage default and custom prompts.
vi: Quản lý các prompt mặc định và tùy chỉnh.

source: Manage Prompts...
vi: Quản lý Prompt...

source: Default prompts: {defaultCount}, Custom prompts: {customCount}
vi: Prompt mặc định: {defaultCount}, Prompt tùy chỉnh: {customCount}

source: Options
vi: Tùy chọn

source: Total Pages (All Files): {count}
vi: Tổng số trang (Tất cả các tệp): {count}

source: Range
vi: Phạm vi

source: From:
vi: Từ:

source: To:
vi: Đến:

source: Translate Output
vi: Dịch đầu ra

source: Start
vi: Bắt đầu

source: Cancel
vi: Hủy

source: Ask about Document
vi: Hỏi về tài liệu

source: File: {name}
vi: Tệp: {name}

source: Uploading to Gemini...
vi: Đang tải lên Gemini...

source: Your Question:
vi: Câu hỏi của bạn:

source: Ready! Ask your questions.
vi: Đã sẵn sàng! Hãy đặt câu hỏi của bạn.

source: Idle
vi: Nhàn rỗi

source: Initializing...
vi: Đang khởi tạo...

source: Previous (Ctrl+PageUp)
vi: Trước (Ctrl+PageUp)

source: Next (Ctrl+PageDown)
vi: Tiếp (Ctrl+PageDown)

source: Go to:
vi: Đến trang:

source: Ask AI (Alt+A)
vi: Hỏi AI (Alt+A)

source: Re-scan with Gemini (Alt+R)
vi: Quét lại bằng Gemini (Alt+R)

source: Generate Audio (Alt+G)
vi: Tạo âm thanh (Alt+G)

source: Save (Alt+S)
vi: Lưu (Alt+S)

source: Page {num} ready
vi: Trang {num} đã sẵn sàng

source: [OCR failed. Try Gemini Re-scan.]
vi: [OCR thất bại. Hãy thử quét lại bằng Gemini.]

source: Error processing page.
vi: Lỗi khi xử lý trang.

source: Page {current} of {total}
vi: Trang {current} trên {total}

source: Processing in background...
vi: Đang xử lý trong nền...

source: Page {num}
vi: Trang {num}

source: Formatted Content
vi: Nội dung được định dạng

source: Please configure Gemini API Key.
vi: Vui lòng cấu hình Khóa API Gemini.

source: Error
vi: Lỗi

source: Current Page
vi: Trang hiện tại

source: All Pages (In Range)
vi: Tất cả các trang (Trong phạm vi)

source: Scanning with Gemini...
vi: Đang quét bằng Gemini...

source: Scan complete
vi: Quét hoàn tất

source: Batch Processing Started
vi: Đã bắt đầu xử lý hàng loạt

source: Error creating temporary PDF.
vi: Lỗi khi tạo tệp PDF tạm thời.

source: Unknown error
vi: Lỗi không xác định

source: Scan failed: {err}
vi: Quét thất bại: {err}

source: Batch Scan Complete
vi: Quét hàng loạt hoàn tất

source: Generate for Current Page
vi: Tạo cho trang hiện tại

source: Generate for All Pages (In Range)
vi: Tạo cho tất cả các trang (Trong phạm vi)

source: No text to read.
vi: Không có văn bản để đọc.

source: Gathering text for audio...
vi: Đang thu thập văn bản cho âm thanh...

source: Save Audio
vi: Lưu âm thanh

source: Generating Audio...
vi: Đang tạo âm thanh...

source: lame.exe not found in lib folder.
vi: Không tìm thấy lame.exe trong thư mục lib.

source: Audio Saved
vi: Đã lưu âm thanh

source: Audio file generated and saved successfully.
vi: Đã tạo và lưu tệp âm thanh thành công.

source: Save
vi: Lưu

source: Saving Page {num}...
vi: Đang lưu Trang {num}...

source: Saved
vi: Đã lưu

source: File saved successfully.
vi: Đã lưu tệp thành công.

source: &Document Reader...
vi: Trình đọc tài liệu (&D)...

source: Transcribe &Audio File...
vi: Chuyển biên tệp âm thanh (&A)...

source: Analyze &Video URL...
vi: Phân tích URL &Video...

source: &Settings...
vi: Cài đặt (&S)...

source: Check for &Update
vi: Kiểm tra cập nhật (&U)

source: Docu&mentation
vi: Tài liệu hướng dẫn (&M)

source: D&onate
vi: Quyên góp (&O)

source: Telegram &Channel
vi: Kênh Telegram (&C)

source: Open
vi: Mở

source: Supported Files
vi: Các tệp được hỗ trợ

source: PyMuPDF library is missing.
vi: Thiếu thư viện PyMuPDF.

source: No readable pages found.
vi: Không tìm thấy trang nào có thể đọc.

source: Activates the Command Layer for quick access to all features.
vi: Kích hoạt Lớp lệnh để truy cập nhanh vào tất cả các tính năng.

source: Translates the selected text or navigator object.
vi: Dịch văn bản đã chọn hoặc đối tượng navigator.

source: Translates the text currently in the clipboard.
vi: Dịch văn bản hiện có trong clipboard.

source: Opens a menu to Explain, Summarize, or Fix the selected text.
vi: Mở menu để Giải thích, Tóm tắt hoặc Sửa lỗi văn bản đã chọn.

source: Performs OCR and description on the entire screen.
vi: Thực hiện OCR và mô tả toàn bộ màn hình.

source: Describes the current object (Navigator Object).
vi: Mô tả đối tượng hiện tại (Đối tượng Navigator).

source: Opens the Document Reader for detailed page-by-page analysis (PDF/Images).
vi: Mở Trình đọc tài liệu để phân tích chi tiết từng trang (PDF/Hình ảnh).

source: Recognizes text from a selected image or PDF file.
vi: Nhận dạng văn bản từ một hình ảnh hoặc tệp PDF đã chọn.

source: Transcribes a selected audio file.
vi: Chuyển biên một tệp âm thanh đã chọn.

source: Analyzes a YouTube, Instagram, Twitter or TikTok video URL.
vi: Phân tích URL video trên YouTube, Instagram, Twitter hoặc TikTok.

source: Attempts to solve a CAPTCHA on the screen or navigator object.
vi: Thử giải quyết CAPTCHA trên màn hình hoặc đối tượng navigator.

source: Records voice, transcribes it using AI, and types the result.
vi: Ghi âm giọng nói, chuyển biên bằng AI và gõ kết quả.

source: Announces the current status of the add-on.
vi: Thông báo trạng thái hiện tại của add-on.

source: Checks for updates manually.
vi: Kiểm tra cập nhật theo cách thủ công.

source: Shows the last AI response in a chat dialog for review or follow-up questions.
vi: Hiển thị phản hồi cuối cùng của AI trong hộp thoại trò chuyện để xem lại hoặc đặt câu hỏi tiếp theo.

source: Shows a list of available commands in the layer.
vi: Hiển thị danh sách các lệnh có sẵn trong lớp.

source: {name} Help
vi: Trợ giúp {name}

source: Upload Connection Error: {reason}
vi: Lỗi kết nối tải lên: {reason}

source: Upload Server Error {code}: {reason}
vi: Lỗi máy chủ tải lên {code}: {reason}

source: File Upload Error: {error}
vi: Lỗi tải lên tệp: {error}

source: Nothing to send.
vi: Không có gì để gửi.

source: Error: Response blocked by AI safety filters.
vi: Lỗi: Phản hồi bị chặn bởi các bộ lọc an toàn của AI.

source: Listening...
vi: Đang nghe...

source: Audio Hardware Error: {error}
vi: Lỗi phần cứng âm thanh: {error}

source: Typing...
vi: Đang gõ...

source: Save Recording Error: {error}
vi: Lỗi lưu bản ghi: {error}

source: No speech detected.
vi: Không phát hiện thấy giọng nói.

source: No speech recognized or Error.
vi: Không nhận dạng được giọng nói hoặc có lỗi.

source: Typed: {text}
vi: Đã gõ: {text}

source: No text found.
vi: Không tìm thấy văn bản.

source: Translating...
vi: Đang dịch...

source: Translated: {text}
vi: Đã dịch: {text}

source: {name} - Translation
vi: {name} - Dịch thuật

source: Choose action:
vi: Chọn hành động:

source: Processing...
vi: Đang xử lý...

source: Uploading file...
vi: Đang tải lên tệp...

source: Analyzing...
vi: Đang phân tích...

source: {name} - Refine Result
vi: {name} - Kết quả tinh chỉnh

source: Uploading & Extracting...
vi: Đang tải lên & Trích xuất...

source: No text detected in the selected file(s).
vi: Không phát hiện thấy văn bản trong (các) tệp đã chọn.

source: Error creating PDF.
vi: Lỗi tạo PDF.

source: {name} - Chat
vi: {name} - Trò chuyện

source: Scanning...
vi: Đang quét...

source: Capture failed.
vi: Chụp thất bại.

source: {name} - Image Analysis
vi: {name} - Phân tích hình ảnh

source: Uploading...
vi: Đang tải lên...

source: Error processing audio.
vi: Lỗi xử lý âm thanh.

source: YouTube / Instagram / Twitter / TikTok Analysis
vi: Phân tích YouTube / Instagram / Twitter / TikTok

source: Enter Video URL (YouTube/Instagram/Twitter/TikTok):
vi: Nhập URL video (YouTube/Instagram/Twitter/TikTok):

source: Error: Invalid URL.
vi: Lỗi: URL không hợp lệ.

source: Error: Unsupported platform. Only YouTube, Instagram, Twitter, and TikTok are supported.
vi: Lỗi: Nền tảng không được hỗ trợ. Chỉ hỗ trợ YouTube, Instagram, Twitter và TikTok.

source: Processing Video...
vi: Đang xử lý video...

source: Error: Could not extract Instagram video.
vi: Lỗi: Không thể trích xuất video Instagram.

source: Error: Could not extract Twitter video.
vi: Lỗi: Không thể trích xuất video Twitter.

source: Error: Could not extract TikTok video.
vi: Lỗi: Không thể trích xuất video TikTok.

source: Downloading Video...
vi: Đang tải xuống video...

source: Error: Download failed.
vi: Lỗi: Tải xuống thất bại.

source: Uploading to AI...
vi: Đang tải lên AI...

source: Analyzing YouTube...
vi: Đang phân tích YouTube...

source: Solving...
vi: Đang giải...

source: No CAPTCHA detected.
vi: Không phát hiện thấy CAPTCHA.

source: Failed.
vi: Thất bại.

source: Checking for updates...
vi: Đang kiểm tra cập nhật...

source: Translating Clipboard...
vi: Đang dịch Clipboard...

source: Clipboard empty.
vi: Clipboard trống.

source: No previous result to show.
vi: Không có kết quả trước đó để hiển thị.

source: Settings dialog is already open.
vi: Hộp thoại cài đặt đã được mở.

source: Opening documentation...
vi: Đang mở tài liệu hướng dẫn...

source: Documentation file not found.
vi: Không tìm thấy tệp tài liệu hướng dẫn.

source: An advanced AI assistant for NVDA using Gemini models. Command Layer: Press NVDA+Shift+V, then: - Smart Translator (T) / Clipboard (Shift+T) - Text Refiner (R) - Describe Object (V) / Full Screen (O) - Online Video Analysis (Shift+V) - Document Reader (D) - File OCR (F) - CAPTCHA Solver (C) - Audio Transcription (A) - Smart Dictation (S) - Announce Status (L) - Check Update (U) - Recall Last Result (Space), - Commands Help (H),
vi: Một trợ lý AI nâng cao dành cho NVDA sử dụng các mô hình Gemini. Lớp lệnh: Nhấn NVDA+Shift+V, sau đó: - Dịch thông minh (T) / Clipboard (Shift+T) - Tinh chỉnh văn bản (R) - Mô tả đối tượng (V) / Toàn màn hình (O) - Phân tích video trực tuyến (Shift+V) - Trình đọc tài liệu (D) - OCR tệp (F) - Giải CAPTCHA (C) - Chuyển biên âm thanh (A) - Đọc chính tả thông minh (S) - Thông báo trạng thái (L) - Kiểm tra cập nhật (U) - Gọi lại kết quả cuối cùng (Space), - Trợ giúp lệnh (H),

source: ## Changes for 4.6 * **Interactive Result Recall:** Added the **Space** key to the command layer, allowing users to instantly reopen the last AI response in a chat window for follow-up questions, even when "Direct Output" mode is active. * **Telegram Community Hub:** Added an "Official Telegram Channel" link to the NVDA Tools menu, providing a quick way to stay updated with the latest news, features, and releases. * **Enhanced Response Stability:** Optimized the core logic for Translation, OCR, and Vision features to ensure more reliable performance and a smoother experience when using direct speech output. * **Improved Interface Guidance:** Updated the settings descriptions and documentation to better explain the new recall system and how it works alongside the direct output settings.
vi: ## Những thay đổi trong phiên bản 4.6 * **Gọi lại kết quả tương tác:** Đã thêm phím **Space** vào lớp lệnh, cho phép người dùng mở lại ngay lập tức phản hồi cuối cùng của AI trong cửa sổ trò chuyện để đặt câu hỏi tiếp theo, ngay cả khi chế độ "Đầu ra trực tiếp" đang hoạt động. * **Cộng đồng Telegram:** Đã thêm liên kết "Kênh Telegram chính thức" vào menu Công cụ của NVDA, cung cấp một cách nhanh chóng để cập nhật những tin tức, tính năng và bản phát hành mới nhất. * **Tăng cường độ ổn định của phản hồi:** Tối ưu hóa logic cốt lõi cho các tính năng Dịch thuật, OCR và Thị giác để đảm bảo hiệu suất đáng tin cậy hơn và trải nghiệm mượt mà hơn khi sử dụng đầu ra giọng nói trực tiếp. * **Cải thiện hướng dẫn giao diện:** Đã cập nhật các mô tả cài đặt và tài liệu hướng dẫn để giải thích rõ hơn về hệ thống gọi lại mới và cách thức hoạt động của nó cùng với các cài đặt đầu ra trực tiếp.
